ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidWritedownClaim.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soap:Header/>
    <soap:Body>
        <MFFordringIndberet_I xmlns="http://skat.dk/begrebsmodel/2009/01/15/">
            <Kontekst/>
            <FordringhaverSystemIDStruktur>
                <VirksomhedSENummer>15151515</VirksomhedSENummer>
            </FordringhaverSystemIDStruktur>
            <MFLeveranceID>1490865898424</MFLeveranceID>
            <FordringAktionSamling>
                <FordringAktion>
                    <MFAktionKode>NEDSKRIV</MFAktionKode>
                    <DMIFordringHaverID>1162</DMIFordringHaverID>
                    <AktionValg>
                        <MFNedskrivFordringStruktur>
                            <DMIFordringEFIFordringID>1</DMIFordringEFIFordringID>
                            <MFAktionID>CHANGE_MFAktionID</MFAktionID>
                            <FordringNedskrivningVirkningFra>2017-03-26+02:00</FordringNedskrivningVirkningFra>
                            <NedskrivningÅrsagStruktur>
                                <FordringNedskrivningÅrsagKode>INDB</FordringNedskrivningÅrsagKode>
                                <FordringNedskrivningÅrsagBegr>Aarsag Begrundelse Tekst</FordringNedskrivningÅrsagBegr>
                            </NedskrivningÅrsagStruktur>
                            <NedskrivningBeløbStruktur>
                                <ValutaKode>DKK</ValutaKode>
                                <FordringNedskrivningBeløb>150.00</FordringNedskrivningBeløb>
                            </NedskrivningBeløbStruktur>
                        </MFNedskrivFordringStruktur>
                    </AktionValg>
                </FordringAktion>
            </FordringAktionSamling>
        </MFFordringIndberet_I>
    </soap:Body>
</soap:Envelope>